app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

  def show
    @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @blog = Blog.new(blog_params)
    if @blog.save
---
INSERT INTO "blogs" ("title", "category", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "11/6"], ["category", "投稿"], ["body", "あいうえお"], ["created_at", "2021-11-06 10:19:55.060306"], ["updated_at", "2021-11-06 10:19:55.060306"]]

  def edit
    @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    blog = Blog.find(params[:id])
    blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "body" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["body", "abcde"], ["updated_at", "2021-11-06 13:48:51.555463"], ["id", 1]]

  def destroy
    blog = Blog.find(params[:id])
    blog.destroy
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 1]]